epsilonrt/esp32c6-cn-package/package/boards.txt
menu.JTAGAdapter=JTAG Adapter
menu.CDCOnBoot=CDC On Boot
menu.PartitionScheme=Partition Scheme
menu.CPUFreq=CPU Frequency
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.FlashSize=Flash Size
menu.UploadSpeed=Upload Speed
menu.DebugLevel=Debug Level
menu.EraseFlash=Erase Flash
menu.ZigbeeMode=Zigbee Mode

##############################################################

# Board name shown in Arduino IDE
waveshare_esp32_c6_zero.name=Waveshare ESP32-C6 Zero

# Bootloader tool configuration
waveshare_esp32_c6_zero.bootloader.tool=esptool_py
waveshare_esp32_c6_zero.bootloader.tool.default=esptool_py

# Upload tools (serial and OTA)
waveshare_esp32_c6_zero.upload.tool=esptool_py
waveshare_esp32_c6_zero.upload.tool.default=esptool_py
waveshare_esp32_c6_zero.upload.tool.network=esp_ota

# Maximum flash and RAM sizes
waveshare_esp32_c6_zero.upload.maximum_size=1310720
waveshare_esp32_c6_zero.upload.maximum_data_size=327680

# Upload flags (optional, usually empty)
waveshare_esp32_c6_zero.upload.flags=
waveshare_esp32_c6_zero.upload.extra_flags=
waveshare_esp32_c6_zero.upload.use_1200bps_touch=false
waveshare_esp32_c6_zero.upload.wait_for_upload_port=false

# Serial port configuration
waveshare_esp32_c6_zero.serial.disableDTR=false
waveshare_esp32_c6_zero.serial.disableRTS=false

# Build configuration
waveshare_esp32_c6_zero.build.mcu=esp32c6
waveshare_esp32_c6_zero.build.core=esp32:esp32
waveshare_esp32_c6_zero.build.variant=waveshare_esp32_c6_zero
waveshare_esp32_c6_zero.build.board=ESP32C6_DEV

# CPU and flash settings
waveshare_esp32_c6_zero.build.cdc_on_boot=0
waveshare_esp32_c6_zero.build.f_cpu=160000000L
waveshare_esp32_c6_zero.build.flash_size=4MB
waveshare_esp32_c6_zero.build.flash_freq=80m
waveshare_esp32_c6_zero.build.flash_mode=qio
waveshare_esp32_c6_zero.build.boot=qio
waveshare_esp32_c6_zero.build.partitions=default

## IDE 2.0 Seems to not update the value
waveshare_esp32_c6_zero.menu.JTAGAdapter.default=Disabled
waveshare_esp32_c6_zero.menu.JTAGAdapter.default.build.copy_jtag_files=0
waveshare_esp32_c6_zero.menu.JTAGAdapter.builtin=Integrated USB JTAG
waveshare_esp32_c6_zero.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
waveshare_esp32_c6_zero.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
waveshare_esp32_c6_zero.menu.JTAGAdapter.external=FTDI Adapter
waveshare_esp32_c6_zero.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
waveshare_esp32_c6_zero.menu.JTAGAdapter.external.build.copy_jtag_files=1
waveshare_esp32_c6_zero.menu.JTAGAdapter.bridge=ESP USB Bridge
waveshare_esp32_c6_zero.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
waveshare_esp32_c6_zero.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

waveshare_esp32_c6_zero.menu.CDCOnBoot.default=Disabled
waveshare_esp32_c6_zero.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_c6_zero.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_c6_zero.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_c6_zero.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.default.build.partitions=default
waveshare_esp32_c6_zero.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
waveshare_esp32_c6_zero.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
waveshare_esp32_c6_zero.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
waveshare_esp32_c6_zero.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.minimal.build.partitions=minimal
waveshare_esp32_c6_zero.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
waveshare_esp32_c6_zero.menu.PartitionScheme.no_fs.build.partitions=no_fs
waveshare_esp32_c6_zero.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
waveshare_esp32_c6_zero.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.no_ota.build.partitions=no_ota
waveshare_esp32_c6_zero.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
waveshare_esp32_c6_zero.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
waveshare_esp32_c6_zero.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.huge_app.build.partitions=huge_app
waveshare_esp32_c6_zero.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
waveshare_esp32_c6_zero.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
waveshare_esp32_c6_zero.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.fatflash.build.partitions=ffat
waveshare_esp32_c6_zero.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
waveshare_esp32_c6_zero.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_c6_zero.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
waveshare_esp32_c6_zero.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker=RainMaker 4MB
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
waveshare_esp32_c6_zero.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_2MB=Zigbee 2MB with spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_2MB.build.partitions=zigbee_2MB
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_2MB.upload.maximum_size=1310720
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee.build.partitions=zigbee
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_8MB=Zigbee 8MB with spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_8MB.build.partitions=zigbee_8MB
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_8MB.upload.maximum_size=3407872
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr_2MB=Zigbee ZCZR 2MB with spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr_2MB.build.partitions=zigbee_zczr_2MB
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr_2MB.upload.maximum_size=1310720
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
waveshare_esp32_c6_zero.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
waveshare_esp32_c6_zero.menu.PartitionScheme.custom=Custom
waveshare_esp32_c6_zero.menu.PartitionScheme.custom.build.partitions=
waveshare_esp32_c6_zero.menu.PartitionScheme.custom.upload.maximum_size=16777216

waveshare_esp32_c6_zero.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_c6_zero.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_c6_zero.menu.CPUFreq.120=120MHz (WiFi)
waveshare_esp32_c6_zero.menu.CPUFreq.120.build.f_cpu=120000000L
waveshare_esp32_c6_zero.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_c6_zero.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_c6_zero.menu.CPUFreq.40=40MHz
waveshare_esp32_c6_zero.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_c6_zero.menu.CPUFreq.20=20MHz
waveshare_esp32_c6_zero.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_c6_zero.menu.CPUFreq.10=10MHz
waveshare_esp32_c6_zero.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_c6_zero.menu.FlashMode.qio=QIO
waveshare_esp32_c6_zero.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_c6_zero.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_c6_zero.menu.FlashMode.dio=DIO
waveshare_esp32_c6_zero.menu.FlashMode.dio.build.flash_mode=dio
waveshare_esp32_c6_zero.menu.FlashMode.dio.build.boot=dio

waveshare_esp32_c6_zero.menu.FlashFreq.80=80MHz
waveshare_esp32_c6_zero.menu.FlashFreq.80.build.flash_freq=80m
waveshare_esp32_c6_zero.menu.FlashFreq.40=40MHz
waveshare_esp32_c6_zero.menu.FlashFreq.40.build.flash_freq=40m

waveshare_esp32_c6_zero.menu.FlashSize.4M=4MB (32Mb)
waveshare_esp32_c6_zero.menu.FlashSize.4M.build.flash_size=4MB
waveshare_esp32_c6_zero.menu.FlashSize.8M=8MB (64Mb)
waveshare_esp32_c6_zero.menu.FlashSize.8M.build.flash_size=8MB
waveshare_esp32_c6_zero.menu.FlashSize.2M=2MB (16Mb)
waveshare_esp32_c6_zero.menu.FlashSize.2M.build.flash_size=2MB
waveshare_esp32_c6_zero.menu.FlashSize.16M=16MB (128Mb)
waveshare_esp32_c6_zero.menu.FlashSize.16M.build.flash_size=16MB

waveshare_esp32_c6_zero.menu.UploadSpeed.921600=921600
waveshare_esp32_c6_zero.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_c6_zero.menu.UploadSpeed.115200=115200
waveshare_esp32_c6_zero.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_c6_zero.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_c6_zero.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_c6_zero.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_c6_zero.menu.UploadSpeed.230400=230400
waveshare_esp32_c6_zero.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_c6_zero.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_c6_zero.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_c6_zero.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_c6_zero.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_c6_zero.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_c6_zero.menu.DebugLevel.none=None
waveshare_esp32_c6_zero.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_c6_zero.menu.DebugLevel.error=Error
waveshare_esp32_c6_zero.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_c6_zero.menu.DebugLevel.warn=Warn
waveshare_esp32_c6_zero.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_c6_zero.menu.DebugLevel.info=Info
waveshare_esp32_c6_zero.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_c6_zero.menu.DebugLevel.debug=Debug
waveshare_esp32_c6_zero.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_c6_zero.menu.DebugLevel.verbose=Verbose
waveshare_esp32_c6_zero.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_c6_zero.menu.EraseFlash.none=Disabled
waveshare_esp32_c6_zero.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_c6_zero.menu.EraseFlash.all=Enabled
waveshare_esp32_c6_zero.menu.EraseFlash.all.upload.erase_cmd=-e

waveshare_esp32_c6_zero.menu.ZigbeeMode.default=Disabled
waveshare_esp32_c6_zero.menu.ZigbeeMode.default.build.zigbee_mode=
waveshare_esp32_c6_zero.menu.ZigbeeMode.default.build.zigbee_libs=
waveshare_esp32_c6_zero.menu.ZigbeeMode.ed=Zigbee ED (end device)
waveshare_esp32_c6_zero.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
waveshare_esp32_c6_zero.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
waveshare_esp32_c6_zero.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
waveshare_esp32_c6_zero.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
waveshare_esp32_c6_zero.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native
waveshare_esp32_c6_zero.menu.ZigbeeMode.ed_debug=Zigbee ED (end device) - Debug
waveshare_esp32_c6_zero.menu.ZigbeeMode.ed_debug.build.zigbee_mode=-DZIGBEE_MODE_ED
waveshare_esp32_c6_zero.menu.ZigbeeMode.ed_debug.build.zigbee_libs=-lesp_zb_api.ed.debug -lzboss_stack.ed.debug -lzboss_port.native.debug
waveshare_esp32_c6_zero.menu.ZigbeeMode.zczr_debug=Zigbee ZCZR (coordinator/router) - Debug
waveshare_esp32_c6_zero.menu.ZigbeeMode.zczr_debug.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
waveshare_esp32_c6_zero.menu.ZigbeeMode.zczr_debug.build.zigbee_libs=-lesp_zb_api.zczr.debug -lzboss_stack.zczr.debug -lzboss_port.native.debug


